/* No comment provided by engineer. */
"%@ %@ is currently the newest version available." = "%1$@ %2$@ on uusin saatavilla oleva versio.";

/* No comment provided by engineer. */
"%@ %@ is currently the newest version available.\n(You are currently running version %@.)" = "%1$@ %2$@ on uusin saatavilla oleva versio.\n(You are currently running version %3$@.)";

/* Description text for SUUpdateAlert when the update is downloadable. */
"%@ %@ is now available—you have %@. Would you like to download it now?" = "%1$@ %2$@ on nyt saatavilla (sinulla on %3$@). Haluatko ladata sen nyt?";

/* The download progress in units of bytes, e.g. 100 KB of 1,0 MB */
"%@ of %@" = "%1$@ / %2$@";

/* No comment provided by engineer. */
"A new version of %@ is available!" = "Uusi versio ohjelmasta  %@ on saatavilla!";

/* No comment provided by engineer. */
"An error occurred in retrieving update information. Please try again later." = "Päivitystietojen haussa tapahtui virhe. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while extracting the archive. Please try again later." = "Pakkauksen purkamisen yhteydessä tapahtui virhe. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"Cancel" = "Kumoa";

/* No comment provided by engineer. */
"Cancel Update" = "Peruuta päivitykset";

/* No comment provided by engineer. */
"Checking for updates…" = "Tarkistetaan päivityksiä…";

/* Take care not to overflow the status window. */
"Downloading update…" = "Haen päivitystä…";

/* Take care not to overflow the status window. */
"Extracting update…" = "Puran päivitystä…";

/* No comment provided by engineer. */
"Install and Relaunch" = "Asenna ja käynnistä ohjelma uudelleen";

/* Take care not to overflow the status window. */
"Installing update…" = "Asennan päivityksen…";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Ready to Install" = "Valmiina asentamaan";

/* No comment provided by engineer. */
"Update Error!" = "Virhe päivityksessä!";

/* No comment provided by engineer. */
"Updating %@" = "Päivitän %@";

/* Status message shown when the user checks for updates but is already current or the feed doesn't contain any updates. */
"You’re up-to-date!" = "Sinulla on viimeisin versio!";
